To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(url)

df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
df.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [5]:
type(df.columns.str.lower())

pandas.core.indexes.base.Index

In [6]:
type(df.columns)

pandas.core.indexes.base.Index

In [7]:
df.columns.str.lower().str.replace(' ', '_')

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [8]:
[e.lower().replace(' ', '_') for e in df.columns]

['customer',
 'st',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

In [9]:
df.columns = df.columns.str.lower().str.replace(' ', '_')

In [10]:
df.head()

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [11]:
df = df.rename(columns={'st': 'state'})

In [12]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. 

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [13]:
nan_cols = df.isna().sum()

nan_cols[nan_cols>0]

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [14]:
df.shape

(4008, 11)

In [15]:
df.gender.unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [16]:
change_gender = {'Femal': 'F', 'Male': 'M', 'female': 'F'}

In [17]:
def cambiar(key):
    
    global change_gender
    
    value = change_gender.get(key, key)
    
    return value

In [18]:
cambiar('Femal')

'F'

In [19]:
cambiar('hola alegre')

'hola alegre'

In [20]:
df.gender.apply(cambiar).unique()

array([nan, 'F', 'M'], dtype=object)

In [21]:
df.gender.apply(lambda key: change_gender.get(key, key)).unique()  #(key, key), el primero es la key del dictio el segundo es el valor por defecto

array([nan, 'F', 'M'], dtype=object)

In [22]:
df.gender = df.gender.apply(lambda key: change_gender.get(key, key))

In [23]:
df.gender.unique()

array([nan, 'F', 'M'], dtype=object)

In [24]:
df.gender.apply(lambda key: None).head()

0    None
1    None
2    None
3    None
4    None
Name: gender, dtype: object

In [25]:
df.gender.head()

0    NaN
1      F
2      F
3      M
4      M
Name: gender, dtype: object

In [26]:
df.state.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [27]:
change_state = {'Cali': 'California', 'AZ': 'Arizona', 'WA': 'Washington'}

df.state = df.state.apply(lambda x: change_state.get(x, x))

In [28]:
df.state.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [29]:
df.education.unique()

array(['Master', 'Bachelor', 'High School or Below', 'College',
       'Bachelors', 'Doctor', nan], dtype=object)

In [30]:
df.education  = df.education.str.replace('Bachelors', 'Bachelor')

In [31]:
df.education.unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [32]:
df.customer_lifetime_value = df.customer_lifetime_value.str.replace('%', '')

In [33]:
df.customer_lifetime_value.head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: object

In [34]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [35]:
df.vehicle_class.unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury SUV', 'Sports Car',
       'Luxury Car', nan], dtype=object)

In [36]:
change_vehicle = {'Luxury Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Sports Car': 'Luxury'}

df.vehicle_class = df.vehicle_class.apply(lambda x: change_vehicle.get(x, x))

In [37]:
df.vehicle_class.unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has a wrong format, look at the diffrent values it takes with unique() and take the middle value, for example 1/5/00 should be 5. Number of open complaints is a string, remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [38]:
df.customer_lifetime_value.dtypes

dtype('O')

In [39]:
pd.to_numeric(df.customer_lifetime_value).head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: float64

In [40]:
df.customer_lifetime_value.apply(lambda x: float(x)).head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: float64

In [41]:
df.customer_lifetime_value.apply(float).head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: float64

In [42]:
df.customer_lifetime_value.astype(float).head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer_lifetime_value, dtype: float64

In [43]:
df.customer_lifetime_value = pd.to_numeric(df.customer_lifetime_value)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1068 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(4), object(7)
memory usage: 344.6+ KB

In [45]:
df.number_of_open_complaints.unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [46]:
df.number_of_open_complaints = df.number_of_open_complaints.str.split('/')

In [47]:
df.number_of_open_complaints = df.number_of_open_complaints.apply(lambda x: x[1] if type(x)==list else x)

In [48]:
df.number_of_open_complaints.unique()

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

In [49]:
df.number_of_open_complaints = df.number_of_open_complaints.apply(float)

In [50]:
df.number_of_open_complaints.unique()

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

In [51]:
'hola'.split('o')

['h', 'la']

In [52]:
'hola'.split('/')

['hola']

In [53]:
'holaholaholahola'.split('o')

['h', 'lah', 'lah', 'lah', 'la']

In [54]:
int('1/0/00'.split('/')[0]) + int('1/0/00'.split('/')[1])

1

In [55]:
'2024-01-24'  > '2023-12-31'

True

In [56]:
help('1/0/00'.split)

Help on built-in function split:

split(sep=None, maxsplit=-1) method of builtins.str instance
    Return a list of the words in the string, using sep as the delimiter string.

    sep
      The delimiter according which to split the string.
      None (the default value) means split according to any whitespace,
      and discard empty strings from the result.
    maxsplit
      Maximum number of splits to do.
      -1 (the default value) means no limit.

In [57]:
'1/0/00'[::-1].split('/', maxsplit=1)[::-1]

['0/1', '00']

In [58]:
'1/0/00/76/67'.split('/')

['1', '0', '00', '76', '67']

In [59]:
'1/0', '0/76/67'

('1/0', '0/76/67')

In [60]:
lst = '1/0/00/76/67'.split('/')   # ['1', '0', '00', '76', '67']

'/'.join(lst[:2]), '/'.join(lst[2:])

('1/0', '00/76/67')

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values. 

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

In [61]:
nan_cols = df.isna().sum()

nan_cols

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [62]:
df.select_dtypes('number').head()  # parte numerica

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
0,NaN,0.0,1000.0,0.0,2.704934
1,697953.59,0.0,94.0,0.0,1131.464935
2,1288743.17,48767.0,108.0,0.0,566.472247
3,764586.18,0.0,106.0,0.0,529.881344
4,536307.65,36357.0,68.0,0.0,17.269323

In [63]:
num_cols = df.select_dtypes('number').columns

In [64]:
num_cols

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'number_of_open_complaints', 'total_claim_amount'],
      dtype='object')

In [66]:
df.dropna(how='all', inplace=True) # si la fila es toda nula a la shit

In [67]:
nan_cols = df.isna().sum()

nan_cols

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [68]:
df.shape

(1071, 11)

In [71]:
df.customer_lifetime_value.fillna(df.customer_lifetime_value.mean(), inplace=True)

In [72]:
nan_cols = df.isna().sum()

nan_cols

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        0
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [74]:
df.gender.mode()

0    F
Name: gender, dtype: object

In [77]:
df.customer.mode()[:10]

0    AA71604
1    AB13432
2    AB60627
3    AB72731
4    AB96670
5    AC40767
6    AE98193
7    AF10970
8    AG85615
9    AH84063
Name: customer, dtype: object

In [78]:
df.dropna(how='all', inplace=True) # si la fila es toda nula a la shit

In [79]:
nan_cols = df.isna().sum()

nan_cols

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        0
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [82]:
df.gender.mode()

0    F
Name: gender, dtype: object

In [84]:
df.gender.mode()[0]

'F'

In [85]:
df.gender = df.gender.fillna(df.gender.mode()[0])

In [86]:
nan_cols = df.isna().sum()

nan_cols

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [87]:
moda_de_genero = df.gender.mode()[0]

moda_de_genero

'F'

In [88]:
df.gender = df.gender.fillna(moda_de_genero)

In [91]:
# recorro por columnas para rellenar con su propia media


for c in num_cols:
    
    df[c] = df[c].fillna(df[c].mean())